//search for all incidents in the last 14 days

let startTime = ago(14d); 
let endTime = now(); 

SecurityIncident 
| where TimeGenerated >= startTime 
| summarize arg_max(TimeGenerated, *) by IncidentNumber 
| where LastModifiedTime  between (startTime .. endTime) 
| where Status in  ('New', 'Active', 'Closed') 
| where Severity in ('High','Medium','Low', 'Informational') 
